app/views/events/_form.html.erb

    <%= form.label :page_id %>
    <%= form.select :page_id, Page.all.collect { |p| [p.name, p.id] } %>
---
SELECT "pages".* FROM "pages"