app/controllers/events_controller.rb

INSERT INTO "events" ("name", "token", "page_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["token", ""], ["page_id", 1], ["created_at", "2021-10-18 11:41:25.804038"], ["updated_at", "2021-10-18 11:41:25.804038"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
---
  def destroy
    @event.destroy