app/controllers/login_controller.rb

  def signing111
    email       = params[:email]
    firstname   = params[:fname]
    lastname    = params[:lname]
    ern_number  = params[:lname]

    event_token = params[:event]
    adjust_created_at = params[:created_at]

    # redirect_to controller: :root, action: :index
    # check user available
    # event_found = Event.where(token: event_token).empty?
    event_id = Event.where(token: event_token).pick(:id)
---
SELECT "events"."id" FROM "events" WHERE "events"."token" = $1 LIMIT $2  [["token", "kjg3y2"], ["LIMIT", 1]]