app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
---
  def index
    @pages = Page.all

INSERT INTO "pages" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Home"], ["created_at", "2021-10-18 09:17:04.212390"], ["updated_at", "2021-10-18 09:17:04.212390"]]
---
  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_page
      @page = Page.find(params[:id])